// mocks/mockCategories.ts

export const mockCategories = {
    '생활용품': {
        '세탁세제': {
            '액체세제': 101,
            '시트형세제': 102,
            '캡슐세제': 103,
        },
        '청소용품': {
            '청소포': 104,
            '걸레': 105,
            '청소솔': 106,
        },
        '욕실용품': {
            '샤워기': 107,
            '욕실정리용품': 108,
        },
    },
    '식품': {
        '과자': {
            '감자칩': 201,
            '쿠키': 202,
            '비스킷': 203,
        },
        '라면/면류': {
            '봉지라면': 204,
            '컵라면': 205,
        },
        '음료': {
            '커피': 206,
            '탄산음료': 207,
            '주스': 208,
        },
    },
    '주방용품': {
        '식기류': {
            '그릇': 301,
            '접시': 302,
            '수저': 303,
        },
        '조리도구': {
            '냄비': 304,
            '프라이팬': 305,
            '칼': 306,
        },
    },
    '가전/디지털': {
        '주방가전': {
            '전자레인지': 401,
            '에어프라이어': 402,
            '전기밥솥': 403,
        },
        '생활가전': {
            '청소기': 404,
            '가습기': 405,
            '선풍기': 406,
        },
    },
};
